OpenFOAM case folders/Experimental validation/Static drift/KVLCC2/Fr0.1424_alpha9.00/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-10.04816224751555 -9.106147036810968 -8.164131826106384)
	(15.072243371273325 -9.106147036810968 -8.164131826106384)
	(15.072243371273325 9.106147036810968 -8.164131826106384)
	(-10.04816224751555 9.106147036810968 -8.164131826106384)
	(-10.04816224751555 -9.106147036810968 2.5120405618788877)
	(15.072243371273325 -9.106147036810968 2.5120405618788877)
	(15.072243371273325 9.106147036810968 2.5120405618788877)
	(-10.04816224751555 9.106147036810968 2.5120405618788877)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (80 58 34) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

