OpenFOAM case folders/Experimental validation/Static drift/KVLCC2/Fr0.1424_alpha9.00/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "system";
	object      fvSchemes;
}

ddtSchemes
{
	default    Euler;
}

gradSchemes
{
	default        Gauss linear;
	limitedGrad    cellLimited Gauss linear 1;
}

divSchemes
{
	div(rhoPhi,U)                          Gauss LUST grad(U);
	div(phi,k)                             Gauss linearUpwind limitedGrad;
	div(phi,omega)                         Gauss linearUpwind limitedGrad;
	div(phi,alpha)                         Gauss vanLeer;
	div(phirb,alpha)                       Gauss linear;
	div(((rho*nuEff)*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
	default                                    Gauss linear corrected;
	laplacian(yPsi)                            Gauss linear corrected;
	laplacian(diffusivity,cellDisplacement)    Gauss linear corrected;
}

interpolationSchemes
{
	default    linear;
}

snGradSchemes
{
	default    corrected;
}

wallDist
{
	method    Poisson;
}

